In [1]:
!pip install ipython-sql
%load_ext sql

# Connect to SQLite database
%sql sqlite:///library.db

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.12/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (3.17.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (2.0.44)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet>=1 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.15.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (75.2.0)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: decorator in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (3.0.52)
Requirement already satisfied: pygments in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (2.19.2)
Requirement already satisfied: backcall in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.2.1)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.12/dist-packages (from prettytable->ipython-sql) (0.2.14)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/local/lib/python3.12/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.5)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.12/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Downloading jedi-0.19.2-py2.py3-none-any.whl (1.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 14.4 MB/s eta 0:00:00
Installing collected packages: jedi
Successfully installed jedi-0.19.2

In [2]:
import prettytable

# Create a fallback DEFAULT style so ipython-sql stops crashing
prettytable.DEFAULT = prettytable.MARKDOWN

/tmp/ipython-input-1532865983.py:4: DeprecationWarning: the 'MARKDOWN' constant is deprecated, use the 'TableStyle' enum instead
  prettytable.DEFAULT = prettytable.MARKDOWN

In [3]:
#TASK_1
%%sql

-- DROP OLD TABLES
DROP TABLE IF EXISTS Loans;
DROP TABLE IF EXISTS Books;
DROP TABLE IF EXISTS Members;

-- CREATE TABLE: Members
CREATE TABLE Members (
    member_id INT PRIMARY KEY,
    name VARCHAR(100),
    email VARCHAR(100) UNIQUE,
    join_date DATE
);

-- CREATE TABLE: Books
CREATE TABLE Books (
    book_id INT PRIMARY KEY,
    title VARCHAR(200),
    author VARCHAR(100),
    available BOOLEAN
);

-- CREATE TABLE: Loans
CREATE TABLE Loans (
    loan_id INT PRIMARY KEY,
    member_id INT,
    book_id INT,
    loan_date DATE,
    return_date DATE,
    FOREIGN KEY (member_id) REFERENCES Members(member_id),
    FOREIGN KEY (book_id) REFERENCES Books(book_id)
);

 * sqlite:///library.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [4]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///library.db
Done.

[('Members',), ('Books',), ('Loans',)]

TASK-2  INSERT INTO queries for the schema

In [5]:
%%sql

INSERT INTO Members (member_id, name, email, join_date) VALUES
(1, 'Rimsha', 'rimu@gmail.com', '2025-10-14'),
(2, 'Mujeeb', 'mujeeb@gmail.com', '2025-10-15'),
(3, 'Qureshi', 'abc@gmail.com', '2025-11-16');

INSERT INTO Books (book_id, title, author, available) VALUES
(101, 'Introduction to Databases', 'C.J. Date', TRUE),
(102, 'The Silent Patient', 'Alex Michaelides', TRUE),
(103, 'Clean Code', 'Robert C. Martin', TRUE);

INSERT INTO Loans (loan_id, member_id, book_id, loan_date, return_date) VALUES
(1, 1, 101, '2025-10-10', NULL),
(2, 2, 102, '2025-10-12', '2025-10-25'),
(3, 3, 103, '2025-10-15', '2025-12-29');

 * sqlite:///library.db
3 rows affected.
3 rows affected.
3 rows affected.

[]

TASK-3 query to list all books borrowed by a specific member (Rimsha)

In [6]:
%%sql

SELECT
    Members.name,
    Books.book_id,
    Books.title,
    Books.author,
    Loans.loan_date,
    Loans.return_date
FROM Loans
JOIN Members ON Loans.member_id = Members.member_id
JOIN Books ON Loans.book_id = Books.book_id
WHERE Members.name = 'Rimsha';

 * sqlite:///library.db
Done.

[('Rimsha', 101, 'Introduction to Databases', 'C.J. Date', '2025-10-10', None)]

TASK 4:Update and Delete Queries

In [7]:
%%sql
UPDATE Books
SET available = FALSE
WHERE book_id = 101;

 * sqlite:///library.db
1 rows affected.

[]

In [10]:
%%sql
DELETE FROM Members
WHERE member_id = 3
AND member_id  IN (
    SELECT member_id FROM Loans WHERE return_date IS '2025-12-29'
);

 * sqlite:///library.db
1 rows affected.

[]

In [13]:
%%sql
SELECT * FROM Members;

 * sqlite:///library.db
Done.

[(1, 'Rimsha', 'rimu@gmail.com', '2025-10-14'),
 (2, 'Mujeeb', 'mujeeb@gmail.com', '2025-10-15')]

In [14]:
%%sql
SELECT * FROM Loans;

 * sqlite:///library.db
Done.

[(1, 1, 101, '2025-10-10', None),
 (2, 2, 102, '2025-10-12', '2025-10-25'),
 (3, 3, 103, '2025-10-15', '2025-12-29')]

In [15]:
%%sql
SELECT * FROM Loans;

 * sqlite:///library.db
Done.

[(1, 1, 101, '2025-10-10', None),
 (2, 2, 102, '2025-10-12', '2025-10-25'),
 (3, 3, 103, '2025-10-15', '2025-12-29')]